
### فایل ترجمه برای صفحه: https://www.rust-lang.org/policies/code-of-conduct

## templates/policies/code-of-conduct.hbs

policies-code-of-conduct-page-title = قوانین رفتاری

coc-conduct-heading = رفتار
coc-conduct-description =
        <ul>
          <li>ما متعهد به ایجاد محیطی دوستانه، امن و خوشایند برای همه هستیم، صرف نظر از سطح تجربه، هویت و ابراز جنسیتی، گرایش جنسی، ناتوانی، ظاهر شخصی، اندازه بدن، نژاد، قومیت، سن، مذهب، ملیت یا ویژگی‌های مشابه دیگر.</li>
          <li>لطفاً از استفاده از نام‌های مستعار یا القاب آشکارا جنسی که ممکن است از محیطی دوستانه، امن و خوشایند برای همه بکاهد خودداری کنید.</li>
          <li>لطفاً مهربان و مودب باشید. نیازی به رفتار بی‌رحمانه یا بی‌ادبانه نیست.</li>
          <li>به تفاوت‌های نظر افراد احترام بگذارید و بدانید که هر انتخاب طراحی یا پیاده‌سازی هزینه‌ها و موازنه‌هایی دارد. به ندرت یک پاسخ قطعی وجود دارد.</li>
          <li>لطفاً نقدهای غیرساختاریافته را به حداقل برسانید. اگر ایده‌های محکمی دارید که می‌خواهید آزمایش کنید، یک fork ایجاد کرده و ببینید چگونه کار می‌کند.</li>
          <li>ما شما را از تعامل حذف خواهیم کرد اگر کسی را توهین کنید، تحقیر کنید یا آزار دهید. این رفتار پذیرفته نیست. ما اصطلاح "آزار" را شامل تعریف ارائه‌شده در <a href="https://github.com/stumpsyn/policies/blob/master/citizen_code_of_conduct.md">Citizen Code of Conduct</a> تفسیر می‌کنیم؛ اگر در مورد اینکه چه چیزی ممکن است در این مفهوم گنجانده شود سردرگم هستید، لطفاً تعریف آن‌ها را بخوانید. به ویژه، ما رفتارهایی که افراد را در گروه‌های اجتماعی به حاشیه راندن، نمی‌پذیریم.</li>
          <li>آزار خصوصی نیز غیرقابل قبول است. فرقی نمی‌کند چه کسی باشید، اگر احساس کردید که توسط یکی از اعضای جامعه آزار داده شده‌اید یا ناراحت شده‌اید، لطفاً فوراً با یکی از مدیران کانال یا هر یک از { $coc-rust-moderation-team-anchor } تماس بگیرید. فرقی نمی‌کند شما یک همکار عادی باشید یا تازه‌وارد، ما اهمیت می‌دهیم که این جامعه برای شما امن باشد و پشت شما هستیم.</li>
          <li>همچنین هر گونه اسپم، ترولینگ، شعله‌ور کردن، یا رفتارهای دیگر که توجه را می‌دزدد نیز پذیرفته نیست.</li>
        </ul>
coc-conduct-description-team-anchor-text = تیم نظارت Rust
coc-conduct-email-button = ایمیل به تیم نظارت

coc-moderation-heading = نظارت
coc-moderation-description =
        <p>این سیاست‌ها برای حفظ استانداردهای رفتاری جامعه ما است. اگر احساس می‌کنید که یک موضوع نیاز به نظارت دارد، لطفاً با { $coc-rust-moderation-team-anchor } تماس بگیرید.</p>
        <ol>
          <li>اظهارنظرهایی که استانداردهای رفتاری Rust را نقض می‌کنند، از جمله اظهارات نفرت‌انگیز، آسیب‌زا، سرکوب‌گر یا تبعیض‌آمیز، مجاز نیستند. (فحاشی مجاز است، اما هرگز نباید یک کاربر دیگر را هدف قرار دهد و هرگز به صورت نفرت‌انگیز بیان نشود.)</li>
          <li>اظهارنظرهایی که توسط مدیران نامناسب تشخیص داده شوند، حتی اگر در قوانین رفتاری ذکر نشده باشند، نیز مجاز نیستند.</li>
          <li>مدیران ابتدا با هشدار به این گونه اظهارنظرها پاسخ خواهند داد.</li>
          <li>اگر به هشدار توجه نشود، کاربر "اخراج" خواهد شد، یعنی از کانال ارتباطی برای خنک شدن اخراج خواهد شد.</li>
          <li>اگر کاربر بازگردد و به ایجاد مشکل ادامه دهد، ممنوع خواهد شد، یعنی به طور نامحدود حذف می‌شود.</li>
          <li>مدیران می‌توانند به اختیار خود کاربر را از ممنوعیت خارج کنند اگر این اولین تخلف بوده و کاربر به طرف مورد آزار واقع شده عذرخواهی صادقانه‌ای ارائه دهد.</li>
          <li>اگر یک مدیر کسی را ممنوع کرد و شما فکر می‌کنید که این کار ناعادلانه بود، لطفاً با آن مدیر، یا با یک مدیر دیگر، <strong>به صورت خصوصی</strong> مطرح کنید. شکایات درباره ممنوعیت‌ها در کانال مجاز نیستند.</li>
          <li>مدیران به استانداردهای بالاتری نسبت به دیگر اعضای جامعه پایبند هستند. اگر یک مدیر موقعیتی نامناسب ایجاد کند، باید انتظار داشته باشد که تحمل کمتری نسبت به دیگران داشته باشد.</li>
        </ol>
        <p>در جامعه Rust ما تلاش می‌کنیم که یک قدم اضافی برای مراقبت از یکدیگر برداریم. تنها به بی‌نقصی فنی اکتفا نکنید، سعی کنید بهترین نسخه خودتان باشید. به خصوص، از شوخی کردن با موضوعات حساس یا تهاجمی، به ویژه اگر خارج از موضوع هستند، پرهیز کنید؛ این معمولاً به دعواهای غیرضروری، احساسات جریحه‌دار شده، و اعتماد آسیب دیده منجر می‌شود؛ بدتر از همه، می‌تواند افراد را کاملاً از جامعه دور کند.</p>
        <p>و اگر کسی به چیزی که گفتید یا انجام دادید اعتراض کرد، از دفاع کردن خودداری کنید. فقط انجام کاری که از آن شکایت شده را متوقف کنید و عذرخواهی کنید. حتی اگر احساس می‌کنید که به اشتباه تفسیر یا ناعادلانه متهم شده‌اید، احتمالاً چیزی وجود داشت که می‌توانستید بهتر منتقل کنید — به یاد داشته باشید که مسئولیت شما این است که همکاران Rustacean خود را راحت کنید. همه می‌خواهند با هم کنار بیایند و ما همگی در درجه اول اینجا هستیم زیرا می‌خواهیم درباره تکنولوژی جذاب صحبت کنیم. شما خواهید دید که افراد تمایل دارند نیت خوب را فرض کنند و ببخشند به شرطی که اعتمادشان را جلب کنید.</p>
        <p>سیاست‌های اجرایی فهرست‌شده در بالا به تمام مکان‌های رسمی Rust اعمال می‌شود؛ از جمله کانال‌های Discord (https://discord.gg/rust-lang)؛ مخازن GitHub تحت rust-lang، rust-lang-nursery، و rust-lang-deprecated؛ و تمام فروم‌ها تحت rust-lang.org (users.rust-lang.org، internals.rust-lang.org). برای پروژه‌های دیگری که از قوانین رفتاری Rust استفاده می‌کنند، لطفاً برای اجرای آن با نگه‌داران آن پروژه‌ها تماس بگیرید. اگر می‌خواهید از این قوانین رفتاری برای پروژه خود استفاده کنید، در نظر داشته باشید که به طور صریح سیاست نظارتی خود را ذکر کنید یا کپی با سیاست نظارتی خود ایجاد کنید تا از سردرگمی جلوگیری شود.</p>
        <p><i>اقتباس شده از <a href="http://blog.izs.me/post/30036893703/policy-on-trolling">سیاست Node.js در مورد ترولینگ</a> و همچنین <a href="https://www.contributor-covenant.org/version/1/3/0/">تعهد مشارکت‌کنندگان نسخه ۱.۳.۰</a>.</i></p>

coc-moderation-description-team-anchor-text = تیم نظارت Rust
