
## templates/community/index.hbs

community-page-title = جامعه
community-blurb = زبان برنامه‌نویسی Rust ویژگی‌های زیادی دارد، اما بزرگ‌ترین قوت Rust جامعه‌ای از افرادی است که گرد هم می‌آیند تا کار با Rust را به تجربه‌ای پربار تبدیل کنند.
community-twir = با جامعه Rust به‌روز بمانید!
community-twir-button = این هفته در Rust
community-team-contact = دوست داریم از شما بشنویم! نمی‌دانید کجا یا از چه کسی سوال کنید؟ می‌خواهید درگیر شوید اما نمی‌دانید چگونه؟ تیم جامعه مشتاق است شما را به کسی که می‌تواند کمک کند متصل کند!
community-team-button = ایمیل { ENGLISH("community@rust-lang.org") }

community-where = کجا صحبت کنیم
community-learn = کجا یاد بگیریم

community-get-in-contact = با ما در ارتباط باشید
community-read-about = درباره Rust بخوانید

community-urlo-header = فروم کاربران
community-urlo = فروم کاربران Rust مکانی برای ارتباط کاربران Rust در مورد هر چیزی است که به Rust مربوط می‌شود. سوالات خود را اینجا بپرسید، ایده‌های پروژه را هماهنگ کنید، هرچه دوست دارید!
community-discourse-button = بازدید از فروم

community-irlo-header = فروم داخلی
community-irlo = فروم داخلی Rust مکانی برای بحث در مورد توسعه خود Rust است &ndash; شامل کار روی کامپایلر و همچنین طراحی زبان و کتابخانه استاندارد.

community-chat-header = پلتفرم‌های چت
community-chat = توسعه Rust و چت عمومی در چندین پلتفرم چت اتفاق می‌افتد. کانال‌های عمومی و موارد دیگر را در سرور Discord Rust بررسی کنید، یا صفحه تیم‌ها را بررسی کنید تا ببینید تیم‌های خاص کجا ملاقات می‌کنند.

community-teams-learn = درباره تیم‌ها بیشتر بدانید

community-events-header = رویدادها
community-meetup-header = یک ملاقات یا کنفرانس محلی پیدا کنید
community-meetup = بیش از 90 ملاقات و چندین کنفرانس در سراسر جهان در بیش از 35 کشور وجود دارد. Rustaceans به طور دوره‌ای در گروه‌های کاربران Rust ملاقات می‌کنند. این ملاقات‌ها مقدمه‌ای عالی برای جامعه هستند و راهی عالی برای یادگیری و معاشرت با افراد دیگر با علاقه مشابه است. ملاقات‌ها معمولاً غیررسمی و برای همه باز هستند.
community-calendar = مشاهده تقویم

community-event-run-header = رویداد خود را اجرا کنید
community-event-run =
          <p>
            با رشد Rust، ما هیجان‌زده هستیم که به افراد کمک کنیم رویدادهای محلی خود را آغاز کنند.
            از هک و یادگیری، تا ملاقات‌ها، تا کنفرانس‌ها، تیم رویدادهای Rust آماده کمک به شما است.
          </p>
          <p>
            ثبت رویداد شما به ما کمک می‌کند تلاش‌های جامعه را پیگیری کنیم و به ما اجازه می‌دهد شما را به سخنرانان یا اعضای دیگر در منطقه شما متصل کنیم.
          </p>
community-rustfest-alt = شرکت‌کنندگان Rustfest

community-irr-header = افزایش دسترسی Rust
community-irr = افزایش دسترسی Rust برنامه‌ای است که اعضای تیم Rust از تمام بخش‌های پروژه را با افرادی که در جامعه Rust و صنعت تکنولوژی نماینده کافی ندارند، برای یک همکاری سه‌ماهه، از اواسط می تا اواسط آگوست، متصل می‌کند. هر همکاری به تعهد 3–5 ساعت در هفته برای کار روی یک پروژه Rust متعهد می‌شود.
community-irr-button = بازدید از وبسایت

community-standards-header = استانداردهای جامعه
community-standards =
        ما متعهد به ارائه محیطی دوستانه، امن و خوشایند برای همه هستیم، بدون توجه به جنسیت، گرایش جنسی، معلولیت، قومیت، مذهب یا ویژگی‌های شخصی مشابه. ما
        <a href="{ $url }">کد رفتاری</a> را تنظیم کرده‌ایم
        تا استانداردهای رفتار در تمام فروم‌های رسمی Rust را تعیین کنیم.
        <br /><br />
        اگر احساس می‌کنید که توسط یکی از اعضای جامعه مورد آزار قرار گرفته‌اید یا ناراحت شده‌اید، لطفاً فوراً با هر یک از
        <a href="mailto:rust-mods@rust-lang.org">تیم نظارت Rust</a>
        تماس بگیرید. چه شما یک مشارکت‌کننده منظم باشید یا یک تازه‌وارد، ما اهمیت می‌دهیم که این جامعه مکانی امن برای شما باشد.

community-mod-button = پیام به تیم نظارت
community-coc-button = خواندن کد رفتاری
community-mod-guidelines-button = خواندن راهنمای نظارت
